using System;


namespace Game.World.Generation.Ores
{

    [Serializable]
    public class OreDefinition
    {

        // =====================================================
        // ID БЛОКА
        // =====================================================

        public string ID;


        // =====================================================
        // ГЛУБИНА ОТ ПОВЕРХНОСТИ
        // =====================================================

        // Минимальная глубина от поверхности.
        //
        // Например:
        // 10 = руда может появляться начиная
        // с 10 блоков ниже поверхности.
        public int MinDepth;


        // Максимальная глубина от поверхности.
        //
        // Например:
        // 80 = руда может появляться
        // максимум на 80 блоков ниже поверхности.
        public int MaxDepth;


        // =====================================================
        // РАСПРЕДЕЛЕНИЕ
        // =====================================================

        // Шанс появления руды.
        //
        // 0.30 = высокая частота
        // 0.10 = средняя
        // 0.03 = редкая
        public float Rarity;


        // =====================================================
        // РАЗМЕР ЖИЛЫ
        // =====================================================

        // Минимальный размер жилы.
        public int MinVeinSize;


        // Максимальный размер жилы.
        public int VeinSize;

        // Биомы в которых генерируется руда
        public string[] Biomes;
        public OreDefinition()
        {

            MinDepth =
                5;


            MaxDepth =
                80;


            Rarity =
                0.15f;


            MinVeinSize =
                3;


            VeinSize =
                7;

        }

    }

}