using System;


namespace Game.World
{

    public class WorldSettings
    {

        // =====================================================
        // WORLD
        // =====================================================

        // Seed мира.
        // Определяет весь процедурно сгенерированный мир.
        public int Seed;


        // Размер чанка по X и Y.
        public int ChunkSize;


        // Радиус загрузки чанков вокруг игрока.
        public int ViewDistance;


        // Полная высота процедурно генерируемого мира
        // в блоках.
        public int WorldHeight;


        // Название мира.
        public string WorldName;


        // =====================================================
        // WORLD VERTICAL BOUNDS
        // =====================================================

        // Базовый уровень поверхности мира.
        //
        // Это НЕ реальная поверхность каждого столбца.
        //
        // Это центральный уровень,
        // относительно которого строится мир.
        public int SurfaceHeight;


        // Нижняя граница мира.
        //
        // Вычисляется автоматически.
        public int BottomWorldY
        {
            get
            {
                return
                    SurfaceHeight -
                    WorldHeight +
                    1;
            }
        }


        // =====================================================
        // TERRAIN
        // =====================================================

        // Высота крупных холмов.
        public int HillHeight;


        // Масштаб крупных холмов.
        public float HillScale;


        // Высота средних неровностей.
        public int TerrainVariation;


        // Масштаб средних неровностей.
        public float TerrainScale;


        // Высота мелких неровностей.
        public int TerrainDetail;


        // Масштаб мелких неровностей.
        public float TerrainDetailScale;

        // =====================================================
        // CAVES
        // =====================================================

        // Минимальная глубина,
        // на которой разрешены пещеры.
        public int CaveMinDepth;


        // Максимальная глубина пещер.
        public int CaveMaxDepth;


        // =====================================================
        // MAIN CAVES
        // =====================================================

        // Размер основной структуры пещер.
        public float CaveScale;


        // Порог основной пещеры.
        public float CaveThreshold;


        // =====================================================
        // SECONDARY CAVES
        // =====================================================

        // Вторичный noise.
        //
        // Отвечает за разрыв
        // огромных непрерывных полостей.
        public float CaveSecondaryScale;


        // Порог вторичного шума.
        public float CaveSecondaryThreshold;

        public float CaveSecondaryStrength;

        // =====================================================
        // TUNNELS
        // =====================================================

        // Масштаб тоннелей.
        public float CaveTunnelScale;


        // Вертикальное растяжение тоннелей.
        public float CaveTunnelVerticalScale;


        // Порог тоннелей.
        public float CaveTunnelThreshold;


        // =====================================================
        // VERTICAL SCALE
        // =====================================================

        // Вертикальное растяжение
        // основной пещерной системы.
        public float CaveVerticalScale;


        // =====================================================
        // CHAMBERS
        // =====================================================

        // Размер камер.
        public float CaveChamberScale;


        // Порог появления камер.
        public float CaveChamberThreshold;


        // Дополнительный noise формы камер.
        public float CaveChamberShapeScale;


        // Порог формы камеры.
        public float CaveChamberShapeThreshold;


        // =====================================================
        // CONSTRUCTOR
        // =====================================================

        public WorldSettings()
        {

            // -------------------------------------------------
            // WORLD
            // -------------------------------------------------

            ChunkSize =
                32;


            ViewDistance =
                5;


            WorldHeight =
                256;


            WorldName =
                "New World";


            Seed =
                new Random().Next();


            // -------------------------------------------------
            // BASE TERRAIN
            // -------------------------------------------------

            SurfaceHeight =
                100;


            // -------------------------------------------------
            // LARGE HILLS
            // -------------------------------------------------

            HillHeight =
                25;


            HillScale =
                0.003f;


            // -------------------------------------------------
            // MEDIUM TERRAIN
            // -------------------------------------------------

            TerrainVariation =
                10;


            TerrainScale =
                0.012f;


            // -------------------------------------------------
            // SMALL TERRAIN DETAIL
            // -------------------------------------------------

            TerrainDetail =
                3;


            TerrainDetailScale =
                0.035f;



            // =====================================================
            // CAVES
            // =====================================================

            CaveMinDepth =
                18;


            CaveMaxDepth =
                WorldHeight - 20;


            // =====================================================
            // MAIN CAVES
            // =====================================================

            CaveScale =
                0.035f;


            CaveThreshold =
                0.9f;


            // =====================================================
            // SECONDARY
            // =====================================================

            CaveSecondaryScale =
                0.065f;


            CaveSecondaryThreshold =
                0.57f;

            CaveSecondaryStrength = 
                0.08f;
            // =====================================================
            // TUNNELS
            // =====================================================

            CaveTunnelScale =
                0.09f;


            CaveTunnelVerticalScale =
                2.5f;


            CaveTunnelThreshold =
                0.7f;


            // =====================================================
            // VERTICAL
            // =====================================================

            CaveVerticalScale =
                1.8f;


            // =====================================================
            // CHAMBERS
            // =====================================================

            CaveChamberScale =
                0.018f;


            CaveChamberThreshold =
                0.82f;


            CaveChamberShapeScale =
                0.045f;


            CaveChamberShapeThreshold =
                0.75f;

        }

    }

}